CBaseTransition.TRANSITION_TYPE
Defines the transition types currently supported by the MFC implementation of Windows Animation API.
Remarks:
A transition type is set in the constructor of specific transition.
For example, CSinusoidalTransitionFromRange sets its type to SINUSOIDAL_FROM_RANGE.